<?php
$coreTimes = [
    1 => '9:00~11:50',
    2 => '12:00~14:50',
    3 => '15:00~16:50'
];

$facilities = [
    1 => '会議室',
    2 => '面接室A',
    3 => '面接室B'
];

$spHoliday = [
    '01-01' => '元日',
    '01-02' => '振替休日',
    '01-09' => '成人の日',
    '02-11' => '建国記念の日',
    '02-23' => '天皇誕生日',
    '03-21' => '春分の日',
    '04-29' => '昭和の日',
    '05-03' => '憲法記念日',
    '05-04' => 'みどりの日',
    '05-05' => 'こどもの日',
    '07-17' => '海の日',
    '08-11' => '山の日',
    '09-18' => '敬老の日',
    '09-23' => '秋分の日',
    '10-09' => 'スポーツの日',
    '11-03' => '文化の日',
    '11-23' => '勤労感謝の日'
];

$facility = [ 
    '01-05' => ['name' => '会議室', 'coreTime' => [1]],
    '02-10' => ['name' => '会議室', 'coreTime' => [2]],
    '03-05' => ['name' => '面接室A', 'coreTime' => [1]],
    '04-05' => ['name' => '会議室', 'coreTime' => [1]],
    '05-10' => ['name' => '面接室A', 'coreTime' => [2]],
    '06-05' => ['name' => '会議室', 'coreTime' => [1]],
    '07-10' => ['name' => '会議室', 'coreTime' => [1]],
    '08-01' => ['name' => '面接室B', 'coreTime' => [1, 2]],
    '08-07' => ['name' => '面接室B', 'coreTime' => [1, 2, 3]],
    '09-05' => ['name' => '会議室', 'coreTime' => [2, 3]],
    '10-10' => ['name' => '面接室B', 'coreTime' => [3]],
    '11-05' => ['name' => '会議室', 'coreTime' => [1]],
    '12-05' => ['name' => '会議室', 'coreTime' => [1]],
    '01-07' => ['name' => '面接室A', 'coreTime' => [2]],
    '02-07' => ['name' => '会議室', 'coreTime' => [1]],
    '02-08' => ['name' => '面接室A', 'coreTime' => [2, 3]],
    '03-08' => ['name' => '会議室', 'coreTime' => [1]],
    '04-08' => ['name' => '会議室', 'coreTime' => [2]],
    '05-09' => ['name' => '面接室B', 'coreTime' => [3]],
    '06-09' => ['name' => '面接室A', 'coreTime' => [2]],
    '07-09' => ['name' => '会議室', 'coreTime' => [1, 2]],
    '08-09' => ['name' => '会議室', 'coreTime' => [1]],
    '08-10' => ['name' => '面接室A', 'coreTime' => [2]],
    '09-10' => ['name' => '面接室B', 'coreTime' => [3]],
    '10-15' => ['name' => '会議室', 'coreTime' => [1]],
];

?>
